---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType
source: html/dde4d9d0-374d-4995-0efc-99db890d2797.htm
---
# EnergyAnalysisWindowType Properties

The id of the assembly instance to which the element belongs.